/* eslint-disable react/no-unescaped-entities */
'use client'
import Breadcrumbs from '@/components/modules/Breadcrumbs/Breadcrumbs'
import { useBreadcrumbs } from '@/hooks/useBreadcrumbs'
import styles from '@/styles/policy/index.module.scss'

const PersonalDataPolicyPage = () => {
  const { getDefaultTextGenerator, getTextGenerator } = useBreadcrumbs(
    'personal_data_policy'
  )

  return (
    <main>
      <Breadcrumbs
        getDefaultTextGenerator={getDefaultTextGenerator}
        getTextGenerator={getTextGenerator}
      />
      <section className={styles.policy}>
        <div className='container'>
          <h1>Політика щодо обробки персональних даних</h1>
          <p>
            <strong>1. Загальні положення</strong>
          </p>
          <p>
            1.1. Ця політика обробки персональних даних складена відповідно до
            статті 8 Закону України «Про захист персональних даних». (Цей
            перелік доступний за посиланням:
            <a href='http://zakon2.rada.gov.ua/laws/show/2297-17'> тут</a> )
            визначає порядок обробки персональних даних та заходи щодо
            забезпечення безпеки персональних даних, які використовує ФОП
            "Кучерява Анастасія Андріївна" (далі – оператор).
          </p>
          <strong>2. Основні поняття, що використовуються у Політиці</strong>
          <p>
            2.1. Автоматизована обробка персональних даних – обробка
            персональних даних за допомогою обчислювальної техніки.
          </p>
          <p>
            2.2. Блокування персональних даних – тимчасове припинення обробки
            персональних даних (крім випадків, якщо обробка необхідна уточнення
            персональних даних).
          </p>
          <p>&nbsp;</p>
          <p>
            <strong>
              3. Оператор може обробляти такі персональні дані Користувача
            </strong>
          </p>
          <ul>
            <li>Прізвище ім'я по батькові.</li>
            <li>Електронна адреса.</li>
            <li>Номери телефонів.</li>
            <li>
              Також на сайті відбувається збір та обробка знеособлених даних про
              відвідувачів (в т.ч. файлів cookie) за допомогою сервісів
              інтернет-статистики (Гугл Аналітика та інших).
            </li>
            <li>
              Вищезазначені дані далі за текстом Політик та об'єднані загальним
              поняттям Персональні дані.
            </li>
          </ul>
          <p>&nbsp;</p>
          <p>
            <strong>4. Цілі обробки персональних даних</strong>
          </p>
          <p>4.1. Мета обробки персональних даних Користувача:</p>
          <ul>
            <li>
              інформування Користувача за допомогою надсилання електронних
              листів;– укладання, виконання та припинення цивільно-правових
              договорів;– надання доступу Користувачеві до сервісів, інформації
              та/або матеріалів, що містяться на веб-сайті
              <a href='https://www.vlasneua.com'> https://www.vlasneua.com.</a>-
              надання доступу Користувачеві до сервісів, інформації та/або
              матеріалів, що містяться в програмах для iOS та Android платформ.
            </li>
            <li>
              Також Оператор має право надсилати Користувачеві повідомлення про
              нові продукти та послуги, спеціальні пропозиції та різні події.
              Користувач завжди може відмовитися від отримання інформаційних
              повідомлень,направивши Оператору листа на адресу електронної пошти
              vlasne.info@gmail.com з позначкою «Відмова від повідомлень про
              нові продукти та послуги та спеціальні пропозиції».
            </li>
            <li>
              Знеособлені дані Користувачів, які збираються за допомогою
              сервісів інтернет-статистики, служать для збору інформації про дії
              Користувачів на сайті, покращення якості сайту та його змісту.
            </li>
          </ul>
          <p>&nbsp;</p>
          <p>
            <strong>5. Правові основи обробки персональних даних</strong>
          </p>
          <p>
            5.1.Оператор обробляє персональні дані Користувача лише у разі їх
            заповнення та/або відправлення Користувачем самостійно через
            спеціальні форми, розташовані на сайті
            <a href='https://www.vlasneua.com'> https://www.vlasneua.com</a> або
            надіслані Оператору за допомогою електронної пошти. Заповнюючи
            відповідні форми та/або надсилаючи свої персональні дані Оператору,
            Користувач висловлює свою згоду з цією Політикою.
          </p>
          <p>&nbsp;</p>
          <p>
            <strong>
              6. Порядок збирання, зберігання, передачі та інших видів обробки
              персональних даних
            </strong>
          </p>
          <p>
            6.1. &nbsp;Безпека персональних даних, що обробляються Оператором,
            забезпечується шляхом реалізації правових, організаційних та
            технічних заходів, необхідних для виконання у повному обсязі вимог
            чинного законодавства у сфері захисту персональних даних.
          </p>
          <p>
            6.2. Оператор забезпечує збереження персональних даних та вживає
            всіх можливих заходів, що виключають доступ до персональних даних
            неуповноважених осіб.
          </p>
          <p>
            6.3. Персональні дані Користувача ніколи, за жодних умов не будуть
            передані третім особам, за винятком випадків, пов'язаних із
            виконанням чинного законодавства.
          </p>
          <p>
            6.4. У разі виявлення неточностей у персональних даних, Користувач
            може актуалізувати їх самостійно шляхом надсилання Оператору
            повідомлення на адресу електронної пошти Оператора
            vlasne.info@gmail.com з позначкою «Актуалізація персональних даних».
          </p>
          <p>
            6.5. Термін обробки персональних даних є необмеженим. Користувач
            може у будь-який момент відкликати свою згоду на обробку
            персональних даних, надіславши Оператору повідомлення через
            електронну пошту на електронну адресу Оператора
            vlasne.info@gmail.com з позначкою «Відгук згоди на обробку
            персональних даних».
          </p>
          <p>&nbsp;</p>
          <p>
            <strong>7. Транскордонна передача персональних даних</strong>
          </p>
          <p>
            7.1. &nbsp;Оператор на початок здійснення транскордонної передачі
            персональних даних зобов'язаний переконатися у цьому, що іноземним
            державою, територію якого передбачається здійснювати передачу
            персональних даних, забезпечується надійний захист прав суб'єктів
            персональних даних.
          </p>
          <p>
            7.2. &nbsp;Транскордонна передача персональних даних на території
            іноземних держав, які не відповідають вищевказаним вимогам, може
            здійснюватися лише у разі наявності згоди у письмовій формі суб'єкта
            персональних даних на транскордонну передачу його персональних даних
            та/або виконання договору, стороною якого є суб'єкт персональних
            даних.
          </p>
          <p>&nbsp;</p>
          <p>
            <strong>8. Заключні положення</strong>
          </p>
          <p>
            8.1. Користувач може отримати будь-які роз'яснення щодо питань, що
            цікавлять обробку його персональних даних, звернувшись до Оператора
            за допомогою електронної пошти vlasne.info@gmail.com.
          </p>
          <p>
            8.2. У цьому документі буде відображено будь-які зміни політики
            обробки персональних даних Оператором. Політика діє безстроково до
            заміни її новою версією.
          </p>
          <p>
            8.3. Актуальна версія Політики у вільному доступі розміщена у мережі
            Інтернет за адресою
            <a href='https://www.vlasneua.com'> https://www.vlasneua.com.</a>
          </p>
        </div>
      </section>
    </main>
  )
}

export default PersonalDataPolicyPage
